import { HiMiniGlobeAsiaAustralia } from 'react-icons/hi2';
import { Link } from 'react-router-dom';

export default function Rules() {
  return (
    <div className='flex flex-col items-center'>
      <div className='flex flex-col  bg-black px-6 py-2 rounded-xl w-fit'><Link to='/' ><HiMiniGlobeAsiaAustralia className='hover:hover:text-purple-800 text-5xl text-white' /></Link></div>
      <h1 className='text-center text-2xl font-semibold'>
        Список правил для игры на сервере Minecraft.
      </h1>
      <div className='m-5 md:mx-60 text-left'>
        <h2 className='font-bold text-left text-2xl flex flex-col'>Правила</h2>
        <div className='bg-gradient-to-r from-indigo-500 via-purple-500 to-pink-500 py-1 px-16 w-fit rounded-lg'></div>
        Общее положение правил Заходя на сервер вы автоматически принимаете
        правила и обязаны их соблюдать Если вы хотите заявить о нарушении, то
        стоит обратится в специальный канал Ложные обращения могут нести
        наказание Администрация в праве выдать вам наказание, в случае если
        подобного правила нет в списке и если администрация считает, что ваши
        действия могут нанести, наносят или уже нанесли вред проекту Данные
        правила проекта распространяются как на внутриигровой сервер Minecraft,
        так и на сервер Discord Наказание может быть снято с виновного в случае
        хорошего поведения или по пришествию определенного кол-во времени без
        дополнительных инцидентов. Подобная процедура названа “Амнистия”. Для её
        получения стоит обратится в канал Discord Участники проекта обязаны
        сообщить о нарушении, в противном случае факт умалчивания будет
        рассчитан как соучастие в нарушении Администрация проекта Администрация
        и модерация проекта может сама определять тяжесть и тип нарушения и
        также на основе своего мнения выносить приговор Модераторы сервера
        являются такими же игроками, как и все остальные участники проекта. Они
        не могут использовать команды для получения предметов или получения
        преимущества над другими игроками. Модераторы и помощники также обязаны
        соблюдать правила Просьба обращаться к администрации с уважением и
        описывать свои мысли без лишних эмоций и капса. Администрация является
        русскоязычной, из чего следует просьба обращаться на доступном для
        понимания языке Администрация проекта не помогает игрокам с развитием и
        не вмешивается в их игровой процесс с целью помощи в развитии. Просьбы
        помощи в предоставлении какой-либо привилегии или внутриигрового
        предмета могут нести наказание Попытка обмана администрации строго
        наказуема Модерации проекта запрещено злоупотреблять своими полномочиями
        и выдавать ложные наказания. Правила распространяются и на модерацию
        Администрация в праве игнорировать ваши личные сообщения, в случае если
        в них не вложено никакой ценной информации. Просьба сообщать о своих
        проблемах одним большим сообщением, высказывая как можно больше ценной
        информации. Сообщения состоящие из одного слова (Прим.: "Привет",
        "Ответь") - игнорируются автоматически Администрацию и модерацию не
        стоит торопить с принятием решения по какому-либо поводу. В случае
        несоблюдения может последовать наказание Чат и коммуникация На сервере
        запрещен флуд и спам в местный и глобальный чат Запрещено прямое или
        косвенное оскорбление и унижение участников проекта или самого проекта
        Запрещено угрожать участникам проекта и самому проекту Запрещено
        оставлять никак не связанные с проектом ссылки в сообщениях, табличках
        или книгах. Также запрещена реклама сторонних проектов, которые не имеют
        отношение к серверу Запрещена любая форма провокации других участников
        проекта Неадекватное поведение в чате, а также насмешки над другими
        участниками проекта строго запрещены. Под данное правило попадают и
        случайные без причинные запросы на телепортацию Запрещено затрагивать
        темы экстремизма, расизма, нацизма и т.п. Запрещено иметь ник/скин,
        несущий в себе нецензурную лексику, брань, контент сексуального
        характера, оскорбление или различные призывы к антисоциальным действиям
        Запрещено призывать людей к антисоциальной деятельности или разжигать
        ненависть к каким-либо личностям, движениям или проектам. Также
        запрещено разжигать или проявлять ненависть Запрещена любая форма
        дезинформации Запрещен капс в чат Игровой процесс Запрещено
        использование стороннего ПО или ресурс-паков, для получения какого-либо
        преимущества над другими игрока. Исключением в правиле являются
        мини-карты, что не отображают положение игроков, ресурсов и мобов
        Запрещено использование ловушек и эксплоитов, для быстрого и нечестного
        умерщвления игроков. Под запрет также попадают и убийство после
        телепортации Запрещено использование эксплоитов и багов в обычной игре
        Запрещено заливание чужих построек лавой или водой. Под запрет также
        попадают любые попытки нарушения целостности чужих регионов Присваивание
        или разрушение построек других игроков запрещено. Доверительным лицом в
        споре будет являться владелец региона. В случае если обвинитель и
        обвиняемый являются владельцами региона – приоритет будет отдаваться
        создателю региона. Просьба отнестись с ответственностью к добавлению
        других людей в свой регион. Любая помеха в создании региона строго
        запрещена. Также под запрет подпадает нарушение целостности окружающей
        среды вокруг региона Воровство вещей строго запрещено Запрещено
        загрязнение окружающей среды постройками не несущими никакого
        практического применения (Столбы, дыры, расстановка блоков по пути
        следования, постройки в виде фаллического символа) Запрещено как-то
        портить постройки без региона, но несущие хоть какое-то практическое или
        эстетическое применение Запрещено создание устройств и построек,
        способных нанести вред серверу PvP Запрещено использование стороннего
        ПО, для получения какого-либо преимущества над другими игрока.
        Исключением в правиле являются только моды на отображение прочности
        своих предметов и отображения состояния здоровья противника PvP разрешен
        на всей незанятой территории всех трех измерений. Победитель в стычке
        имеет полное право распоряжаться выпавшими вещами проигравшего Если в
        вашем регионе разрешен PvP – то данная территория будет также считаться
        полноценной PvP зоной со всеми вытекающими Изменение флага на PvP в
        регионе без ведома находящихся в нем игроков запрещено Запрещено
        использования ловушек не позволяющих одной из сторон отвечать на
        входящий урон. Исключением являются размещенная по среди боя паутина,
        кристаллы и лава Инвентарь и снаряжение Администрация не возвращает
        инвентарь, если вы потеряли его во время стандартного игрового процесса
        или в альтернативных измерениях. Вещи могут быть возвращены только если
        вы их потеряли из-за ошибки сервера. Запрещены любые вещи, с названием
        несущим в себе какое-либо оскорбление или призывом к каким-либо
        антисоциальным действиям Запрещена любая форма дюпа Кланы Создание клана
        с оскорбительным, провокационным или неадекватным названием запрещено. В
        случае если ваш клан будет удален по данной причине – денежная
        компенсация не выдается На внутренний чат клана распространяются те же
        правила, что на обычный чат (Смотри раздел 3. “Чат и Коммуникация”)
        Создание оскорбительных и провокационных баннеров строго запрещена Если
        последний участник клана оказался в бане – клан автоматически
        расформировывается Наказания и амнистия Все выданные наказания не
        подлежат обсуждению в негативном ключе или злорадству со стороны
        окружающих В случае если игрок получает перманентную блокировку без
        возможности амнистии – может быть произведен откат всех затронутых им
        блоков, даже если они составляют из себя постройку в чужом регионе
        Наказания имеют свойства аккумулироваться, из-за чего каждое последующее
        наказание может расти в тяжести в геометрической прогрессии, вплоть до
        перманентной блокировки Амнистия может быть выдана на усмотрение
        администрации проекта. В случае если вы оказались заблокированы и на
        сервере Discord – амнистия не выдается вовсе Любая попытка обхода
        наказания влечет за собой перманентную блокировку
      </div>
    </div>
  );
}
