export default function Rules() {
  return (
    <div>
      <div className='relative border-b-2 border-purple-600'>
        <img src='/header-background.jpg' className='object-cover w-full h-96' alt='' />
        <h1 className='absolute top-1/2 left-1/2 transform -translate-x-1/2 -translate-y-1/2 font-bold text-2xl text-center bg-clip-text text-transparent bg-gradient-to-r from-blue-900 to-purple-900'>
          Соблюдайте правила сервера
        </h1>
      </div>
      <div className='p-10 '>
        <h1 className='font-bold text-2xl'>Правила</h1>
        <p className='bg-gradient-to-r from-indigo-500 via-purple-500 to-pink-500 py-1 px-20 w-fit rounded-lg'></p>
      </div>
      <div className='px-10 pb-10 max-w-4xl mx-auto'>
        <h1 className='font-bold text-xl'>1 Общее положение правил</h1>
        <ul className='font-medium pl-3 space-y-1'>
          <li>
            <strong>1.1</strong> Незнание правил не освобождают от
            ответственности
          </li>
          <li>
            <strong>1.2</strong> Если вы хотите заявить о нарушении, то стоит
            обратится в специальный канал
          </li>
          <li>
            <strong>1.3</strong> Ложные обращения могут нести наказание
          </li>
          <li>
            <strong>1.4</strong> Администрация в праве выдать вам наказание, в
            случае если подобного правила нет в списке и если администрация
            считает, что ваши действия могут нанести, наносят или уже нанесли
            вред проекту
          </li>
          <li>
            <strong>1.5</strong> Данные правила проекта распространяются как на
            внутриигровой сервер Minecraft, так и на сервер Discord
          </li>
          <li>
            <strong>1.6</strong> Наказание может быть снято с виновного в случае
            хорошего поведения или по пришествию определенного кол-во времени
            без дополнительных инцидентов. Подобная процедура названа
            “Амнистия”. Для её получения стоит обратится в канал
            #прошение-о-разбане
          </li>
          <li>
            <strong>1.7</strong> Участники проекта обязаны сообщить о нарушении,
            в противном случае факт умалчивания будет рассчитан как соучастие в
            нарушении
          </li>
        </ul>
        <h1 className='font-bold text-xl mt-2'>2 Администрация проекта</h1>
        <ul className='font-medium pl-3 space-y-1'>
          <li>
            <strong>2.1</strong> Администрация и модерация проекта может сама
            определять тяжесть и тип нарушения и также на основе своего мнения
            выносить приговор
          </li>
          <li>
            <strong>2.2</strong> Модераторы сервера являются такими же игроками,
            как и все остальные участники проекта. Они не могут использовать
            команды для получения предметов или получения преимущества над
            другими игроками. Модераторы и помощники также обязаны соблюдать
            правила
          </li>
          <li>
            <strong>2.3</strong> Просьба обращаться к администрации с уважением
            и описывать свои мысли без лишних эмоций и капса. Администрация
            является русскоязычной, из чего следует просьба обращаться на
            доступном для понимания языке
          </li>
          <li>
            <strong>2.4</strong> Администрация проекта не помогает игрокам с
            развитием и не вмешивается в их игровой процесс с целью помощи в
            развитии. Просьбы помощи в предоставлении какой-либо привилегии или
            внутриигрового предмета могут нести наказание
          </li>
          <li>
            <strong>2.5</strong> Попытка обмана администрации строго наказуема
          </li>
          <li>
            <strong>2.6</strong> Модерации проекта запрещено злоупотреблять
            своими полномочиями и выдавать ложные наказания. Правила
            распространяются и на модерацию
          </li>
          <li>
            <strong>2.7</strong> Администрация в праве игнорировать ваши личные
            сообщения, в случае если в них не вложено никакой ценной информации.
            Просьба сообщать о своих проблемах одним большим сообщением,
            высказывая как можно больше ценной информации. Сообщения состоящие
            из одного слова (Прим.: "Привет", "Ответь") - игнорируются
            автоматически
          </li>
          <li>
            <strong>2.8</strong> Администрацию и модерацию не стоит торопить с
            принятием решения по какому-либо поводу. В случае несоблюдения может
            последовать наказание
          </li>
        </ul>
        <h1 className='mt-2 text-lg font-bold'>3 Чат и коммуникация</h1>
        <ul className='font-medium pl-3 space-y-1'>
          <li>
            <strong>3.1</strong> На сервере запрещен флуд и спам в местный и
            глобальный чат
          </li>
          <li>
            <strong>3.2</strong> Запрещено прямое или косвенное оскорбление и
            унижение участников проекта или самого проекта
          </li>
          <li>
            <strong>3.3</strong> Запрещено угрожать участникам проекта и самому
            проекту
          </li>
          <li>
            <strong>3.4</strong> Запрещено оставлять никак не связанные с
            проектом ссылки в сообщениях, табличках или книгах. Также запрещена
            реклама сторонних проектов, которые не имеют отношение к серверу
          </li>
          <li>
            <strong>3.5</strong> Запрещена любая форма провокации других
            участников проекта
          </li>
          <li>
            <strong>3.6</strong> Неадекватное поведение в чате, а также насмешки
            над другими участниками проекта строго запрещены. Под данное правило
            попадают и случайные без причинные запросы на телепортацию
          </li>
          <li>
            <strong>3.7</strong> Запрещено затрагивать темы экстремизма,
            расизма, нацизма и т.п.
          </li>
          <li>
            <strong>3.8</strong> Запрещено иметь ник/скин, несущий в себе
            нецензурную лексику, брань, контент сексуального характера,
            оскорбление или различные призывы к антисоциальным действиям
          </li>
          <li>
            <strong>3.9</strong> Запрещено призывать людей к антисоциальной
            деятельности или разжигать ненависть к каким-либо личностям,
            движениям или проектам. Также запрещено разжигать или проявлять
            ненависть
          </li>
          <li>
            <strong>3.10</strong> Запрещена любая форма дезинформации
          </li>
          <li>
            <strong>3.11</strong> Запрещен капс в чат
          </li>
        </ul>
        <h1 className='mt-2 text-lg font-bold'>4 Игровой процесс</h1>
        <ul className='font-medium pl-3 space-y-1'>
          <li>
            <strong>4.1</strong> Запрещено использование стороннего ПО или
            ресурс-паков, для получения какого-либо преимущества над другими
            игрока. Исключением в правиле являются мини-карты, что не отображают
            положение игроков, ресурсов и мобов
          </li>
          <li>
            <strong>4.2</strong> Запрещено использование ловушек и эксплоитов,
            для быстрого и нечестного умерщвления игроков. Под запрет также
            попадают и убийство после телепортации
          </li>
          <li>
            <strong>4.3</strong> Запрещено использование эксплоитов и багов в
            обычной игре
          </li>
          <li>
            <strong>4.4</strong> Запрещено заливание чужих построек лавой или
            водой. Под запрет также попадают любые попытки нарушения целостности
            чужих регионов
          </li>
          <li>
            <strong>4.5</strong> Присваивание или разрушение построек других
            игроков запрещено. Доверительным лицом в споре будет являться
            владелец региона. В случае если обвинитель и обвиняемый являются
            владельцами региона – приоритет будет отдаваться создателю региона.
            Просьба отнестись с ответственностью к добавлению других людей в
            свой регион.
          </li>
          <li>
            <strong>4.6</strong> Любая помеха в создании региона строго
            запрещена. Также под запрет подпадает нарушение целостности
            окружающей среды вокруг региона
          </li>
          <li>
            <strong>4.7</strong> Воровство вещей строго запрещено
          </li>
          <li>
            <strong>4.8</strong> Запрещено загрязнение окружающей среды
            постройками не несущими никакого практического применения (Столбы,
            дыры, расстановка блоков по пути следования, постройки в виде
            фаллического символа)
          </li>
          <li>
            <strong>4.9</strong> Запрещено как-то портить постройки без региона,
            но несущие хоть какое-то практическое или эстетическое применение
          </li>
          <li>
            <strong>4.10</strong> Запрещено создание устройств и построек,
            способных нанести вред серверу
          </li>
        </ul>
        <h1 className='mt-2 text-lg font-bold'>5 PvP</h1>
        <ul className='font-medium pl-3 space-y-1'>
          <li>
            <strong>5.1</strong> Запрещено использование стороннего ПО, для
            получения какого-либо преимущества над другими игрока. Исключением в
            правиле являются только моды на отображение прочности своих
            предметов и отображения состояния здоровья противника
          </li>
          <li>
            <strong>5.2</strong> PvP разрешен на всей незанятой территории всех
            трех измерений. Победитель в стычке имеет полное право распоряжаться
            выпавшими вещами проигравшего
          </li>
          <li>
            <strong>5.3</strong> Если в вашем регионе разрешен PvP – то данная
            территория будет также считаться полноценной PvP зоной со всеми
            вытекающими
          </li>
          <li>
            <strong>5.4</strong> Изменение флага на PvP в регионе без ведома
            находящихся в нем игроков запрещено
          </li>
          <li>
            <strong>5.5</strong> Запрещено использования ловушек не позволяющих
            одной из сторон отвечать на входящий урон. Исключением являются
            размещенная по среди боя паутина, кристаллы и лава
          </li>
        </ul>
        <h1 className='mt-2 text-lg font-bold'>6 Инвентарь и снаряжение</h1>
        <ul className='font-medium pl-3 space-y-1'>
          <li>
            <strong>6.1</strong> Администрация не возвращает инвентарь, если вы
            потеряли его во время стандартного игрового процесса или в
            альтернативных измерениях. Вещи могут быть возвращены только если вы
            их потеряли из-за ошибки сервера. За подробностями подачи запроса на
            возвращение вещей обращайтесь в канал #жалобы
          </li>
          <li>
            <strong>6.2</strong> Запрещены любые вещи, с названием несущим в
            себе какое-либо оскорбление или призывом к каким-либо антисоциальным
            действиям
          </li>
          <li>
            <strong>6.3</strong> Запрещена любая форма дюпа
          </li>
        </ul>
        <h1 className='mt-2 text-lg font-bold'>7 Кланы</h1>
        <ul className='font-medium pl-3 space-y-1'>
          <li>
            <strong>7.1</strong> Создание клана с оскорбительным, провокационным
            или неадекватным названием запрещено. В случае если ваш клан будет
            удален по данной причине – денежная компенсация не выдается
          </li>
          <li>
            <strong>7.2</strong> На внутренний чат клана распространяются те же
            правила, что на обычный чат (Смотри раздел 3. “Чат и Коммуникация”)
          </li>
          <li>
            <strong>7.3</strong> Создание оскорбительных и провокационных
            баннеров строго запрещена
          </li>
          <li>
            <strong>7.4</strong> Если последний участник клана оказался в бане –
            клан автоматически расформировывается
          </li>
        </ul>
        <h1 className='mt-2 text-lg font-bold'>8 Наказания и амнистия</h1>
        <ul className='font-medium pl-3 space-y-1'>
          <li>
            <strong>8.1</strong> Все выданные наказания не подлежат обсуждению в
            негативном ключе или злорадству со стороны окружающих
          </li>
          <li>
            <strong>8.2</strong> В случае если игрок получает перманентную
            блокировку без возможности амнистии – может быть произведен откат
            всех затронутых им блоков, даже если они составляют из себя
            постройку в чужом регионе
          </li>
          <li>
            <strong>8.3</strong> Наказания имеют свойства аккумулироваться,
            из-за чего каждое последующее наказание может расти в тяжести в
            геометрической прогрессии, вплоть до перманентной блокировки
          </li>
          <li>
            <strong>8.4</strong> Амнистия может быть выдана на усмотрение
            администрации проекта. В случае если вы оказались заблокированы и на
            сервере Discord – амнистия не выдается вовсе
          </li>
          <li>
            <strong>8.5</strong> Любая попытка обхода наказания влечет за собой
            перманентную блокировку
          </li>
        </ul>
      </div>
    </div>
  );
}
