export default function ServerInfo() {
  return (
    <div>
      <div className='md:grid grid-cols-2'>
        <div className='px-10 text-center'>
          <h1 className='font-bold text-2xl'>Semi-Classic</h1>
          <p className='font-extralight'>
            Мы стремимся создать атмосферу, близкую к классическому выживанию в
            Minecraft.Здесь установлен только небольшой набор
            плагинов, чтобы сохранить ощущение ванильной игры. Одним из
            интересных аспектов нашего сервера является наличие элементов
            бартера. Вы сможете взаимодействовать с другими игроками, предлагая
            им свои ресурсы и предметы в обмен на нужные вам материалы. Это
            позволяет развивать экономику на сервере и стимулирует
            взаимодействие между игроками.
          </p>
        </div>
        <div className='px-10 text-center'>
          <h1 className='font-bold text-2xl'>Survival</h1>
          <p className='font-extralight'>
            На нашем сервере установлен плагин Aurelium Skills, добавляющий
            прокачку вашего персонажа, углубляя ваш игровой процесс. Большие
            приваты дадут вам простор и позволят вам свободно развиваться и
            строить все, что вы запланируете, показывая свою креативность, не
            беспокоясь о внешних угрозах. Мы гордимся дружелюбным и активным
            сообществом, где вы сможете найти себе новых друзей.
          </p>
        </div>
      </div>
    </div>
  );
}
